Revit 2026 API

# CorrectionFactorSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual CorrectionFactorSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As CorrectionFactorSetIterator
```
```cpp
public:
virtual CorrectionFactorSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> CorrectionFactorSetIterator
override ForwardIterator : unit -> CorrectionFactorSetIterator
```

#### Return Value

CorrectionFactorSetIteratorReturns a forward moving iterator to the set.

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace